export const CITIESDATA = {
  1: [
    {
      title:
        'Нанимаем Менеджера Специй, Банкетного зала и Повозки - всех до 3-го ур. (340 камней)',
      completed: false,
    },
    {
      title: 'Поднимаем фабрику Специй до 25 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Банкетный зал и Повозка (лошадь) до 10 уровня',
      completed: false,
    },
    {
      title:
        'Строим фабрику Соков 1 уровня. Нанимаем Менеджера Соков до 2-го уровня (60 камней)',
      completed: false,
    },
    {
      title: 'Поднимаем Соки до 5-го уровня',
      completed: false,
    },
    {
      title: 'Поднимаем Банкетный зал и Повозка (лошадь) до 25 уровня',
      completed: false,
    },
    {
      title: 'Поднимаем Соки до 25-го уровня',
      completed: false,
    },
    {
      title:
        'Строим Фабрику Фермы (яблоки) 1 уровня. Нанимаем менеджера Фермы (яблоки) 1го уровня (30 камней)',
      completed: false,
    },
    {
      title: 'Поднимаем Банкетный зал и Повозка (лошадь) до 50 уровня',
      completed: false,
    },
    {
      title: 'Поднимаем фабрику Специй до 50 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Ферму (яблоки) до 5 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Соки до 50 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Банкетный зал и Повозка (лошадь) до 100 уровня',
      completed: false,
    },
    {
      title: 'Поднимаем Ферму (яблоки) до 30 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Специи до 100 уровня.',
      completed: false,
    },
    {
      title:
        'Строим Фабрику Пекарни. Нанимаем Менеджера Пекарни до 2-го уровня (120 камней).',
      completed: false,
    },
    {
      title: 'Поднимаем Банкетный зал и Повозку (лошадь) до 150 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Пекарню до 7 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Ферму (яблоки) до 50 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Соки до 100 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Повозку (лошадь) до 175 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Банкетный зал до 174 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Банкетный зал и Повозку (лошадь) до 200 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Пекарню до 25 уровня.',
      completed: false,
    },
    {
      title:
        'Строим Мясника. Нанимаем Менеджера мясника до 2-го уровня (150 золота).',
      completed: false,
    },
    {
      title: 'Поднимаем Мясник до 6 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Пекарню до 50 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Банкетный зал и Повозку (лошадь) до 250 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Ферму (яблоки) до 100 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Мясник до 25 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Повозку (лошадь) до 295 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Банкетный зал до 295 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Повозку (лошадь) до 298 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Банкетный зал до 300 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Повозку (лошадь) до 300 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Мясник до 50 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем специи до 200 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Соки до 125+ уровня.',
      completed: false,
    },
    {
      title: 'Ждем 8.4 или 4.2В для следующего города.',
      completed: false,
    },
  ],
  2: [
    {
      title:
        'Берём Менеджеров: Банкетный зал (3), Повозка (лошадь) (3) и Специи (1) - 290 камней.',
      completed: false,
    },
    {
      title: 'Поднимаем фабрику Специй до 25 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Банкетный зал и Повозка (лошадь) до 10 уровня.',
      completed: false,
    },
    {
      title:
        'Строим фабрику Соков 1 уровня. Нанимаем Менеджера Соков до 3-го уровня (120 камней).',
      completed: false,
    },
    {
      title: 'Поднимаем Соки до 5-го уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Банкетный зал и Повозка (лошадь) до 25 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Соки до 25-го уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Банкетный зал и Повозка (лошадь) до 50 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем фабрику Специй до 50 уровня.',
      completed: false,
    },
    {
      title:
        'Строим Фабрику Фермы (яблоки) 1 уровня. Нанимаем Менеджера Фермы (яблоки) 1го уровня (30 камней).',
      completed: false,
    },
    {
      title: 'Поднимаем Ферму (яблоки) до 5 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Банкетный зал и Повозка (лошадь) до 100 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Ферму (яблоки) до 31 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Соки до 50-го уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем фабрику Специй до 100 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Банкетный зал и Повозка (лошадь) до 150 уровня.',
      completed: false,
    },
    {
      title:
        'Строим Фабрику Пекарни. Нанимаем Менеджера Пекарни до 2-го уровня (120 камней).',
      completed: false,
    },
    {
      title: 'Поднимаем Пекарню до 9 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Повозка (лошадь) до 189 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Банкетный зал до 200 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Повозка (лошадь) до 200 уровня.',
      completed: false,
    },
    {
      title:
        'Строим Фабрику Мясник. Нанимаем Менеджера Мясник до 1-го уровня (50 камней).',
      completed: false,
    },
    {
      title: 'Поднимаем пекарню до 25 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Соки до 100 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем мясника до 14 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Повозка (лошадь) до 235 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Банкетный зал до 250 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Повозка (лошадь) до 250 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем мясника до 32 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Ферму (яблоки) до 100 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Специи до 200.',
      completed: false,
    },
    {
      title: 'Поднимаем Банкетный зал до 265 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Повозка (лошадь) до 288 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Банкетный зал до 300 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Повозка (лошадь) до 300 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем мясника до 50 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Соки до 154 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Ферму (яблоки) до 106 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем пекарню до 55 уровня.',
      completed: false,
    },
    {
      title: 'Ждем 8.4 или 4.2В для следующего города.',
      completed: false,
    },
  ],
  3: [
    {
      title:
        'Нанимаем Менеджеров: Банкетный зал (4), Повозка (лошадь) (3), Специи (1) - 440 камней.',
      completed: false,
    },
    {
      title: 'Поднимаем фабрику Специй до 25 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Банкетный зал и Повозку до 3 уровня.',
      completed: false,
    },
    {
      title:
        'Строим фабрику соков 1 уровня. Нанимаем Менеджера Соков до 2-го уровня (60 камней).',
      completed: false,
    },
    {
      title: 'Поднимаем Повозку и Банкетный зал до 10-го уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Соки до 10-го уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Банкетный зал и Повозка до 25 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Соки до 25-го уровня.',
      completed: false,
    },
    {
      title:
        'Строим Фабрику Фермы (яблоки). Нанимаем Менеджера Фермы (яблоки) 2го уровня (90 камней)',
      completed: false,
    },
    {
      title: 'Поднимаем Банкетный зал и Повозка до 50 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Ферму (яблоки) до 5 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Банкетный зал и Повозка до 100 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Ферму (яблоки) до 25 уровня.',
      completed: false,
    },
    {
      title:
        'Строим пекарню. Нанимаем Менеджера Пекарни до 1-го уровня (40 камней).',
      completed: false,
    },
    {
      title: 'Поднимаем Ферму (яблоки) до 29 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Специи до 100 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Банкетный зал и Повозка до 150 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем пекарню до 10 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем ферму (яблоки) до 50 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем сок до 100 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Повозку (лошадь) до 181 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Банкетный зал до 200 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Повозку (лошадь) до 200 уровня.',
      completed: false,
    },
    {
      title:
        'Строим мясника. Нанимаем Менеджера Мясник до 1-го уровня (50 камней).',
      completed: false,
    },
    {
      title: 'Поднимаем Пекарню до 25 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Мясника до 15 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Банкетный зал до 210 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Повозку (лошадь) до 228 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Банкетный зал до 250 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Повозку (лошадь) до 250 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Мясник до 28 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Пекарню до 50 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Соки до 150 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Повозку (лошадь) до 288 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Банкетный зал до 300 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Повозку (лошадь) до 300 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Мясник до 50 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Ферму (яблоки) до 100 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Специи до 200 уровня.',
      completed: false,
    },
    {
      title: 'Ждем 8.4 или 4.2В для следующего города.',
      completed: false,
    },
  ],
};

export type CitiesDataType = typeof CITIESDATA;

export const TasksData = {
  1: [
    {
      title: '',
      complete: false,
    },
  ],
  2: [],
  3: [],
};
