export const CITIESDATA = {
  1: [
    {
      title:
        'Нанимаем Менеджера Специй, Пиршества и Карета - всех до 3-го ур. (340 камней)',
      tasks: [
        {
          title: 'Наймите распорядителя',
        },
        {
          title:
            'Наймите распорядителя для вашего Каретного двора или Зала для пиршеств',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем Специй до 25 уровня.',
      tasks: [
        {
          title: 'Улучшите лавку Специи до 25 уровня',
        },
        {
          title: 'Улучшите распорядителя пиршества до уровня 3',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем Пиршество и Карету до 3 уровня',
      tasks: [],
      completed: false,
    },
    {
      title:
        'Строим Соки 1 уровня. Нанимаем Менеджера Соков до 2-го уровня (60 камней)',
      tasks: [
        {
          title: 'Постройте лавку соков',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем Пиршества и Карету до 10 уровня',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Соки до 10-го уровня',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Пиршества и Карету до 25 уровня',
      tasks: [
        {
          title: 'Соберите 50К провизии для пира',
        },
        {
          title: 'Улучшите здание 50 раз',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем Соки до 25-го уровня',
      tasks: [],
      completed: false,
    },
    {
      title:
        'Строим Ферму яблок 1 уровня. Нанимаем менеджера Фермы яблок 1го уровня (30 камней)',
      tasks: [
        {
          title: 'Соберите 1М провизии для пира',
        },
        {
          title: 'Постройте ферму яблок',
        },
        {
          title: 'Наймите распорядителя для фермы яблок',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем Пиршества и Карету до 50 уровня',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Ферму яблок до 5 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Соки до 50 уровня.',
      tasks: [
        {
          title: 'Улучшите лавку соков до уровня 50',
        },
        {
          title: 'Улучшите своего торговца напитками до уровня 2',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем Пиршества и Карету до 75 уровня',
      tasks: [
        {
          title: 'Улучшите здание 50 раз',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем Ферму яблок до 10 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Пиршества и Карету до 100 уровня',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Ферму яблок до 25 уровня.',
      tasks: [
        {
          title: 'Перевезите 250М провизии для пира в повозке',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем Специи до 100 уровня.',
      tasks: [
        {
          title: 'Улучшите лавку Специи до уровня 100',
        },
      ],
      completed: false,
    },
    {
      title:
        'Строим Пекарню. Нанимаем Менеджера Пекарни до 2-го уровня (120 камней).',
      tasks: [
        {
          title: 'Произведите 1В провизии для пира',
        },
        {
          title: 'Постройте пекарню',
        },
        {
          title: 'Наймите главного пекаря уровня 2 для пекарни',
        },
        {
          title: 'Улучшите торговца специями до уровня 3',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем Пиршества и Карету до 125 уровня.',
      tasks: [
        {
          title: 'Улучшите здание 50 раз',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем Пиршества и Карету до 150 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Пекарню до 5 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Ферму яблок до 50 уровня.',
      tasks: [
        {
          title: 'Улучшите ферму до уровня 50',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем Соки до 100 уровня.',
      tasks: [
        {
          title: 'Улучшите лавку соков до уровня 100',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем Пекарню до 10 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title:
        'Строим Мясника. Нанимаем Менеджера мясника до 2-го уровня (150 золота).',
      tasks: [
        {
          title: 'Соберите 50В провизии для пира',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем Пиршества и Карету до 175 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Пиршества и Карету до 200 уровня.',
      tasks: [
        {
          title: 'Улучшите здание 100 раз',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем Мясник до 10 уровня.',
      tasks: [
        {
          title: 'Перевезите 1Т провизии для пира в повозке',
        },
        {
          title: 'Наймите менеджера мясника уровня 2',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем Пекарню до 25 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Пиршества и Карету до 225 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Мясник до 15 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Пиршества и Карету до 250 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Мясник до 25 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Ферму (яблоки) до 100 уровня.',
      tasks: [
        {
          title: 'Улучшите здания 150 раз',
        },
        {
          title: 'Улучшите ферму до уровня 100',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем Пекарню до 50 уровня.',
      tasks: [
        {
          title: 'Произведите 4Т провизии для пира в производственных зданиях',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем Пиршества до 275 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Мясник до 30 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Карету до 265 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Ждем 2 часа пока завершиться задача на сбор Соков 10В.',
      tasks: [
        {
          title: 'Сбор 10В от соков',
        },
        {
          title: 'Улучшите пекарню до уровня 50',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем специи до 200 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Соки до 160 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Ферму (яблоки) до 110 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Пекарню до 60 уровня.',
      tasks: [
        {
          title: 'Улучшить здания 200 раз',
        },
        {
          title: 'Улучшите Специи до уровня 200',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем Пиршества до 300 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Карету до 300 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Мясник до 50 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Ждем 8.4 или 4.2В для следующего города.',
      tasks: [],
      completed: false,
    },
  ],
  2: [
    {
      title:
        'Берём Менеджеров: Пиршества (3), Карету (3) и Специи (1) - 290 камней.',
      tasks: [
        {
          title: 'Наймите распорядителя для своего Каретного двора',
        },
        {
          title: 'Улучшите кучера до уровня 3',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем фабрику Специй до 25 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Пиршества и Карету до 3 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title:
        'Строим фабрику Соков 1 уровня. Нанимаем Менеджера Соков до 3-го уровня (120 камней).',
      tasks: [
        {
          title: 'Постройте лавку соков',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем Пиршества и Карету до 10 уровня.',
      tasks: [
        {
          title: 'Улучшите зал для пиршеств до уровня 10',
        },
        {
          title: 'Улучшите торговца напитками до уровня 2',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем Соки до 10-го уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Пиршества и Карету до 25 уровня.',
      tasks: [
        {
          title: 'Улучшите здание 50 раз',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем Соки до 25-го уровня.',
      tasks: [],
      completed: false,
    },
    {
      title:
        'Строим Фабрику Фермы (яблоки) 1 уровня. Нанимаем Менеджера Фермы (яблоки) 1го уровня (30 камней).',
      tasks: [
        {
          title: 'Произведите 60К специи в лавке специи',
        },
        {
          title: 'Постройте ферму яблок',
        },
        {
          title: 'Улучшите распорядителя пиршества до уровня 3',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем Пиршества и Карету до 50 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Ферму (яблоки) до 5 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Пиршества и Карету до 75 уровня.',
      tasks: [
        {
          title: 'Перевезите 15М провизии для пира в повозке',
        },
        {
          title: 'Улучшите здание 100 раз',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем Ферму (яблоки) до 10 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Пиршества и Карету до 100 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Ферму (яблоки) до 25 уровня.',
      tasks: [
        {
          title: 'Улучшите ферму до уровня 25',
        },
      ],
      completed: false,
    },
    {
      title:
        'Строим Фабрику Пекарни. Нанимаем Менеджера Пекарни до 2-го уровня (120 камней).',
      tasks: [
        {
          title: 'Наймите главного пекаря уровня 2 в пекарню',
        },
      ],
      completed: false,
    },

    {
      title: 'Поднимаем фабрику Специй до 100 уровня.',
      tasks: [
        {
          title: 'Улучшите лавку Специи до уровня 100',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем Пиршества и Карету до 125 уровня.',
      tasks: [
        {
          title: 'Улучшите здание 100 раз',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем Пиршества и Карету до 150 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Пекарню до 4 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Подождать сбор 99В провизии для пира',
      tasks: [
        {
          title: 'Соберите 99В провизии для пира',
        },
      ],
      completed: false,
    },
    {
      title:
        'Строим Фабрику Мясник. Нанимаем Менеджера Мясник до 1-го уровня (50 камней).',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Пиршества и Карету до 200 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем пекарню до 25 уровня.',
      tasks: [
        {
          title: 'Улучшите пекарню до уровня 25',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем Соки до 100-го уровня.',
      tasks: [
        {
          title: 'Улучшите лавку соков до уровня 100',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем мясника до 15 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Карету до 235 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Пиршества до 250 уровня.',
      tasks: [
        {
          title: 'Соберите 16Т провизии для пира',
        },
        {
          title: 'Постройте лаву мясных деликатесов',
        },
        {
          title: 'Улучшите торговца напитками до уровня 3',
        },
        {
          title: 'Произведите 5Т буханок хлеба в пекарне',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем Карету до 250 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем мясника до 25 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Ферму (яблоки) до 100 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Специи до 200.',
      tasks: [
        {
          title: 'Улучшите здания 150 раз',
        },
        {
          title: 'Улучшите Специи до уровня 200',
        },
        {
          title: 'Перевезти 32Т провизии для пира в повозке',
        },
        {
          title: 'Улучшить ферму до уровня 100',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем Пиршества до 290 уровня.',
      tasks: [
        {
          title: 'Произведите 15Т продуктов на ферме',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем мясника до 50 уровня.',
      tasks: [
        {
          title: 'Улучшить лавку мясных деликатесов до уровня 50',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем Пиршества до 300 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Карету до 300 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Соки до 160 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Ферму (яблоки) до 110 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем пекарню до 60 уровня.',
      tasks: [
        {
          title: 'Улучшите здание 150 раз',
        },
      ],
      completed: false,
    },
    {
      title: 'Ждем 8.4 или 4.2В для следующего города.',
      tasks: [],
      completed: false,
    },
  ],
  3: [
    {
      title:
        'Нанимаем Менеджеров: Пиршества (4), Карету (3), Специи (1) - 440 камней.',
      tasks: [
        {
          title: 'Наймите менеджера специи',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем фабрику Специй до 25 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Пиршества и Повозку до 3 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title:
        'Строим фабрику соков 1 уровня. Нанимаем Менеджера Соков до 2-го уровня (60 камней).',
      tasks: [
        {
          title: 'Наймите менеджера соков',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем Повозку и Пиршества до 10-го уровня.',
      tasks: [
        {
          title: 'Улучшите Карету до уровня 10',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем Соки до 10-го уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Пиршества и Повозка до 25 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Соки до 25-го уровня.',
      tasks: [
        {
          title: 'Улучшите здания 50 раз',
        },
        {
          title: 'Улучшите Соки до уровня 25',
        },
        {
          title: 'Улучшите менеджера Пиршества до уровня 2',
        },
      ],
      completed: false,
    },
    {
      title:
        'Строим Фабрику Фермы (яблоки). Нанимаем Менеджера Фермы (яблоки) 2го уровня (90 камней)',
      tasks: [
        {
          title: 'Произведите 50К специи',
        },
        {
          title: 'Улучшить менеджера Соков до уровня 2',
        },
        {
          title: 'Постройте ферму',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем Пиршества и Повозка до 50 уровня.',
      tasks: [
        {
          title: 'Улучшите здания 50 раз',
        },
        {
          title: 'Улучшите менеджера Кареты до уровня 3',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем Ферму (яблоки) до 5 уровня.',
      tasks: [
        {
          title: 'Перевезите 3М провизии для пира в повозке',
        },
        {
          title: 'Наймите менеджера фермы до уровня 2',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем Повозка и Пиршества до 100 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Ферму (яблоки) до 25 уровня.',
      tasks: [
        {
          title: 'Улучшите ферму до уровня 25',
        },
      ],
      completed: false,
    },
    {
      title:
        'Строим пекарню. Нанимаем Менеджера Пекарни до 1-го уровня (40 камней).',
      tasks: [
        {
          title: 'Соберите 1В провизии для пира',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем Специи до 100 уровня.',
      tasks: [
        {
          title: 'Улучшите специи до уровня 100',
        },
        {
          title: 'Постройте пекарню',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем Карету до 125 уровня.',
      tasks: [
        {
          title: 'Улучшите здания 100 раз',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем Пиршества и Повозка до 150 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем пекарню до 6 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем ферму (яблоки) до 50 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title:
        'Строим мясника. Нанимаем Менеджера Мясник до 1-го уровня (50 камней).',
      tasks: [
        {
          title: 'Произведите 25В продуктов на ферме',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем сок до 100 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Пиршества и Повозка до 200 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Мясника до 6 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Пекарню до 25 уровня.',
      tasks: [
        {
          title: 'Улучшите пекарню до уровня 25',
        },
        {
          title: 'Улучшите менеджера Пиршества до уровня 4',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем Мясника до 18 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Пиршества и Повозка до 250 уровня.',
      tasks: [
        {
          title: 'Произведите 3В напитков',
        },
        {
          title: 'Постройте лавку мясных деликатесов',
        },
        {
          title: 'Улучшите здание 100 раз',
        },
        {
          title: 'Перевезите 30Т провизии для пира в повозке',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем Мясника до 25 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Пекарню до 50 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Соки до 150 уровня.',
      tasks: [
        {
          title: 'Улучшите Соки до уровня 150',
        },
        {
          title: 'Улучшите Пекарню до уровня 50',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем Мясника до 30 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Ферму (яблоки) до 100 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Специи до 200 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Мясник до 50 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Поднимаем Карету до 300 уровня.',
      tasks: [
        {
          title: 'Поизводство 10Т в мясной лавке',
        },
        {
          title: 'Улучшите ферму до уровня 100',
        },
        {
          title: 'Улучшите лавку мясных деликатесов до уровня 50',
        },
        {
          title: 'Улучшите Специи до уровня 200',
        },
      ],
      completed: false,
    },
    {
      title: 'Поднимаем Пиршества до 300 уровня.',
      tasks: [],
      completed: false,
    },
    {
      title: 'Ждем 8.4 или 4.2В для следующего города.',
      tasks: [],
      completed: false,
    },
  ],
};

export type CitiesDataType = typeof CITIESDATA;

export const TasksData = {
  1: [
    {
      title: '',
      complete: false,
    },
  ],
  2: [],
  3: [],
};
