export const CITIESDATA = {
  1: [
    {
      title:
        'Нанимаем Менеджера Специй, Банкетного зала и Повозки - всех до 3-го ур. (340 камней)',
      completed: false,
    },
    {
      title: 'Завершаем 2 задачи на менеджеров.',
      completed: false,
    },
    {
      title:
        'Поднимаем фабрику Специй до 25 уровня. Закрываем задачу. Закрываем задачу на менеджера.',
      completed: false,
    },
    {
      title: 'Поднимаем Банкетный зал и Повозка (лошадь) до 3 уровня',
      completed: false,
    },
    {
      title: 'Строим фабрику Соков 1 уровня. Закрываем задачу',
      completed: false,
    },
  ],
  2: [
    {
      title:
        'Берём Менеджеров: Банкетный зал (3), Повозка (лошадь) (3) и Специи (1) - 290 камней.',
      completed: false,
    },
    {
      title: 'Завершаем 2 задачи на менеджеров.',
      completed: false,
    },
    {
      title: 'Поднимаем фабрику Специй до 25 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Банкетный зал и Повозка (лошадь) до 3 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Банкетный зал и Повозка (лошадь) до 3 уровня.',
      completed: false,
    },
  ],
  3: [
    {
      title:
        'Нанимаем Менеджеров: Банкетный зал (4), Повозка (лошадь) (3), Специи (1) - 440 камней.',
      completed: false,
    },
    {
      title: 'Поднимаем фабрику Специй до 25 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Банкетный зал и Повозку до 3 уровня.',
      completed: false,
    },
    {
      title:
        'Строим фабрику соков 1 уровня. Нанимаем Менеджера Соков до 2-го уровня (60 камней).',
      completed: false,
    },
    {
      title: 'Поднимаем Повозку и Банкетный зал до 10-го уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Соки до 10-го уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Банкетный зал и Повозка до 25 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Соки до 25-го уровня.',
      completed: false,
    },
    {
      title:
        'Строим Фабрику Фермы (яблоки). Нанимаем Менеджера Фермы (яблоки) 2го уровня (90 камней)',
      completed: false,
    },
    {
      title: 'Поднимаем Банкетный зал и Повозка до 50 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Ферму (яблоки) до 5 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Банкетный зал и Повозка до 100 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Ферму (яблоки) до 25 уровня.',
      completed: false,
    },
    {
      title:
        'Строим пекарню. Нанимаем Менеджера Пекарни до 1-го уровня (40 камней).',
      completed: false,
    },
    {
      title: 'Поднимаем Ферму (яблоки) до 29 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Специи до 100 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Банкетный зал и Повозка до 150 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем пекарню до 10 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем ферму (яблоки) до 50 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем сок до 100 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Повозку (лошадь) до 181 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Банкетный зал до 200 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Повозку (лошадь) до 200 уровня.',
      completed: false,
    },
    {
      title:
        'Строим мясника. Нанимаем Менеджера Мясник до 1-го уровня (50 камней).',
      completed: false,
    },
    {
      title: 'Поднимаем Пекарню до 25 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем мясника до 15 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Банкетный зал до 210 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Повозку (лошадь) до 228 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Банкетный зал до 250 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Повозку (лошадь) до 250 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Мясник до 28 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Пекарню до 50 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Соки до 150 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Повозку (лошадь) до 288 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Банкетный зал до 300 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Повозку (лошадь) до 300 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Мясник до 50 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Ферму (яблоки) до 100 уровня.',
      completed: false,
    },
    {
      title: 'Поднимаем Специи до 200 уровня.',
      completed: false,
    },
    {
      title: 'Ждем 8.4 или 4.2В для следующего города.',
      completed: false,
    },
  ],
};

export type CitiesDataType = typeof CITIESDATA;
